/**
 * 常用正则判断
 */
const REGEXP = {
  FLOAT: /^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$/, // 非负浮点数
  EMAIL: /^([a-zA-Z0-9_\.\-])+\@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})+$/, // 邮箱
  PHONE: /^1[3,4,5,6,7,8,9]\d{9}$/, // 手机号
  EN: /^[A-Za-z]+$/, // 英文不为空
  ZH: /^[\u4e00-\u9fa5]+$/, // 中文不为空
  NO_NULL: /^\S/, // 不为空
  NULL: /.*/, // 可以为空
  MSG_CODE: /^\d{6}$/, // 6位正整数(短信验证)
  WECHAT: /^[a-zA-Z\d_-]{6,}$/, // 微信正则
  IS_BAIDU: /\.baidu\.com\//, // 是否百度
  ID: /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/, // 身份证
  PLATE: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/, // 车牌号
  PLATE_AREA: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}$/, // 车牌区号
  PLATE_NUM: /^[A-Z]{1}([A-Z0-9]{4}|[A-Z0-9]{5})[A-Z0-9挂学警港澳]{1}$/, // 车牌号码号
}